Twist/Twist-TAS/servicerequestfiles/retrieveProductOffering.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://www.ibm.com/telecom/v8.5.0/businessobject/system/sid-v12.5/messageview" xmlns:com="http://www.ibm.com/telecom/v8.5.0/businessobject/system/sid-v12.5/common">
   <soapenv:Header/>
   <soapenv:Body>
      <mes:retrieveProductOfferingDetailsInput>
         <Header>
            <com:CorrelationId_T>dpmppbeta-79185-2016173040133</com:CorrelationId_T>
            <com:ActivityName_T>ProductionOfferingRequest</com:ActivityName_T>
            <com:MsgType_T>retrieveProductOfferingDetailsInput</com:MsgType_T>
            <com:Source>@channel</com:Source>
            <com:MessageId>00001071901466481651</com:MessageId>
            <com:MessageProp_T>
               <com:name>LANGUAGE</com:name>
               <com:Value>
                  <com:value>English</com:value>
               </com:Value>
            </com:MessageProp_T>
            <com:Timestamp>2016-06-21T00:01:36.193-04:00</com:Timestamp>   
            <com:ConsumerInfo>
               <com:name>Channel</com:name>
               <com:Value>
                  <com:value>@channel</com:value>
               </com:Value>
            </com:ConsumerInfo>
            <com:ConsumerInfo>
               <com:name>BrandName</com:name>
               <com:Value>
                  <com:value>@brandname</com:value>
               </com:Value>
            </com:ConsumerInfo>
         </Header>
         <Payload>
            <com:SearchCriteria>
               <com:Entities>
                  <com:ID>
                     <com:ID>@esn</com:ID>
                     <com:name>ESN</com:name>
                  </com:ID>
               </com:Entities>
            </com:SearchCriteria>
            <com:FilterCriteria>
               <!--UPDATED: This is added to provide main product list-->
               <com:Entities>
                  <com:ID>
                     <com:ID>@mercassociation</com:ID>
                     <com:name>MERCHANDISING_ASSOCIATIONS</com:name>
                  </com:ID>   
               </com:Entities>
            </com:FilterCriteria>
         </Payload>
      </mes:retrieveProductOfferingDetailsInput>
   </soapenv:Body>
</soapenv:Envelope>